ccxxrr12/WCES/firmware/esp32-c5-csi-node/sdkconfig.defaults
# ESP32-C5 CSI Node - Generated by apply-config.ps1 (Node 1)
# Generated: 2026-07-19 05:45:26
# Topology: RZ/G2L at 192.168.1.3:5005
#           ESP32-C5 #1: TDM slot 0/3

# Target
CONFIG_IDF_TARGET="esp32c5"

# WiFi
CONFIG_CSI_WIFI_SSID="ORBI62"
CONFIG_CSI_WIFI_PASSWORD="sweetship413"
CONFIG_CSI_TARGET_IP="192.168.1.3"
CONFIG_CSI_TARGET_PORT=5005
CONFIG_CSI_WIFI_CHANNEL=36
CONFIG_CSI_NODE_ID=1
CONFIG_CSI_WIFI_BAND="5G"

# Partition table (8MB + OTA)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_display.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# CSI enable
CONFIG_ESP_WIFI_CSI_ENABLED=y

# Channel hopping
CONFIG_CSI_CHANNEL_HOP_ENABLED=y

# Edge intelligence
CONFIG_EDGE_TIER=2
CONFIG_EDGE_TOP_K=8
CONFIG_EDGE_VITAL_INTERVAL_MS=1000
CONFIG_EDGE_FALL_THRESH=15000
CONFIG_EDGE_POWER_DUTY=100

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Logging
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Network (PSRAM enables larger buffers)
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_LWIP_UDP_RECVMBOX_SIZE=12
CONFIG_LWIP_MAX_SOCKETS=16

# WiFi buffers 鈥?C5 SRAM limited, keep conservative even with PSRAM
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6

# Memory (C5 HP SRAM 384KB + N8R8 8MB Quad SPI PSRAM)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=7168

# PSRAM 鈥?N8R8 module has 8MB Quad SPI PSRAM, now enabled
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_BOOT_INIT=y

# WASM deferred to RZ/G2L native Rust (edge_module_engine.rs)
CONFIG_WASM_ENABLE=n

# Display off (use external touchscreen via RZ/G2L)
# CONFIG_DISPLAY_ENABLE is not set

# Mock CSI off (real hardware)
# CONFIG_CSI_MOCK_ENABLED is not set
